// pages/user/logs/logs.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    logData: [{
      version: "v2.1.1",
      data: "2023/2/5",
      info: ["1.新增新闻资讯模板+3", "2.样式库代码调整"]
    }, {
      version: "v2.1.0",
      data: "2023/1/12",
      info: ["1.新增完整UI模板《北岛小店》", "2.新增倒计时样式", "3.新增进步器样式", "4.样式库代码调整"]
    }, ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})